# написати програму, яка просить в користувача ввести через пробіл міста, в яких він був за минулі 10 років
# потім окремо запросити у користувача міста, куди він хоче поїхати внаступні 10 років
# вивести на екран повідомлення з текстом про те, що користувачу, мабуть, дуже сподобалося в містах, які він повторив в двох циклах вводу,
# якщо повтору не було - вивести повідомлення, що користувач відкритий до чогось нового
# врахувати випадки, що користувач нічого не вводить не потрібно, в даному випадку вам явно зазначено, що ці перевірки не потрібні.
# не потрібно перевіряти введення цифр
# ми виходим із того, що користувач введе щось на зразок "Київ Тернопіль париЖ акапулько-80"
# В той же час врахуйте, що користувач може вводити дані в різних регістрах
# використати сети

past_10year_cities = input('enter cities that you visited in last 10 years>>>:').title().split()
future_10year_cities = input('enter cities that you wish to visit in next 10 years>>>:').title().split()
set1 = set(past_10year_cities)
set2 = set(future_10year_cities)

if set1.isdisjoint(set2):

    print("You are opened for new adventures")

else:

    print(f'Seems you really love city(s) {set1.intersection(set2)}')
